--
-- Таблиця рейтингових показників
--

USE `teachRate`; SET NAMES UTF8;

--
-- Table structure for table `question`
--

DROP TABLE IF EXISTS `question`;

CREATE TABLE `question` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `magicField` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `number` int(11) NOT NULL,
  `name` varchar(300) COLLATE utf8_unicode_ci NOT NULL,
  `maxDigit` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `role` int(11) NOT NULL,
  `comment` varchar(300) COLLATE utf8_unicode_ci NOT NULL,
  `type` int(11) NOT NULL,
  `vidkontr_id` int(11) NULL,
  `prorektkontr_id` int(11) NULL,
  PRIMARY KEY (`id`),
  KEY `index2` (`magicField`,`number`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `question`
--

LOCK TABLES `question` WRITE, `teachResult` WRITE, `teachResultCopy`  WRITE;
ALTER TABLE `question` DISABLE KEYS;

INSERT INTO `question` VALUES 

(1,'',0,'<b>Кваліфікаційний потенціал викладача - КП</b>','0',2,'',1,NULL,NULL),


(2,'3',1,'Членство в НАН України:','0',2,'',2,51,NULL),
(3,'',0,'- академік','50',2,'',3,51,NULL),
(4,'',0,'- член-кореспондент','45',2,'',3,51,NULL),

(5,'3',2,'Членство в державних галузевих академіях наук (НААН, НАМН, НАПН, НАПрН, НАМ України):','0',2,'',2,51,NULL),
(6,'',0,'- академік','40',2,'',3,51,NULL),
(7,'',0,'- член-кореспондент','35',2,'',3,51,NULL),

(8,'3',3,'Наявність наукового ступеня:','0',2,'Враховується тільки один показник',2,51,NULL),
(9,'',0,'- доктор наук','25',2,'',3,51,NULL),
(10,'',0,'- кандидат наук (доктор філософії)','12',2,'',3,51,NULL),

(11,'3',4,'Наявність вченого звання:','0',2,'Враховується тільки один показник',2,51,NULL),
(12,'',0,'- професор','25',2,'',3,51,NULL),
(13,'',0,'- доцент','13',2,'',3,51,NULL),

(14,'12',5,'Отримані державні відзнаки (почесні звання, нагороди):','0',2,'Враховуються усі наявні показники (за кожну відзнаку, нагороду)',2,51,NULL),
(15,'',0,'- лауреат Державної премії в галузі науки і техніки України (премії ім. Т.Г.Шевченка)','25',2,'',3,51,NULL),
(16,'',0,'- лауреат премії Президента України для молодих учених, премії Верховної Ради України найталановитішим молодим ученим','20',2,'',3,51,NULL),
(17,'',0,'- заслужений діяч науки і техніки України','25',2,'',3,51,NULL),
(18,'',0,'- заслужений працівник (освіти, фізичної культури, архітектор тощо) України','25',2,'',3,51,NULL),
(19,'',0,'- ордени','10',2,'',3,51,NULL),
(20,'',0,'- почесна грамота Верховної Ради України, Кабінету Міністрів України, подяка Президента України','8',2,'',3,51,NULL),
(21,'',0,'- медалі, нагрудні відзнаки МОН','8',2,'',3,51,NULL),
(22,'',0,'- відмінник освіти, грамота МОН','6',2,'',3,51,NULL),
(23,'',0,'- грамота обласної ради, облдержадміністрації','5',2,'',3,51,NULL),
(24,'',0,'- майстер спорту','5',2,'',3,51,NULL),
(25,'',0,'- кандидат у майстри спорту','3',2,'',3,51,NULL),

(26,'',6,'Індекс Гірша, розрахований за базою даних Scopus (за кожний пункт)','25',2,'',4,54,NULL),


(27,'',0,'<b>Виробнича і творча активність викладача з основних напрямів діяльності</b>','0',2,'',1,NULL,NULL),
(28,'',0,'<b>Навчально-методична робота - НМ</b>','0',2,'',1,NULL,NULL),


(29,'2',1,'Навчальне навантаження:','0',2,'',2,52,NULL),
(30,'',0,'- викладання та підготовка методичного забезпечення дисциплін іноземною мовою (за одну)','30',2,'',3,52,NULL),

(31,'3',2,'Дидактичне забезпечення навчального процесу:','0',2,'',2,52,NULL),
(32,'',0,'- створення інтерактивного комплексу навчально-методичного забезпечення дисципліни (ІКМЗД) (за один на всіх авторів)','30',2,'',3,52,NULL),
(33,'',0,'- розроблення та впровадження дистанційного курсу з навчальної дисципліни для дистанційного навчання (за один на всіх розробників)','60',2,'',3,52,NULL),

(34,'4',3,'Видавнича діяльність:','0',2,'За підручник, посібник, монографію чи видання в цілому на всіх співавторів',2,52,NULL),
(35,'',0,'- підготовка і видання навчального підручника (посібника) з грифом університету обсягом не менше 18 др. арк., тиражем не менше 300 примірників та за наявності посилань на друковані праці авторів (співавторів)','100',2,'',3,52,NULL),
(36,'',0,'- видання монографії обсягом не менше 18 др.арк. та тиражем не менше 300 примірників','70',2,'',3,52,NULL),(37,'',0,'- інші видання, у тому числі словники, довідники, практикуми, стандарти тощо тиражем не менше 300 примірників','30',2,'',3,52,NULL),


(38,'',0,'<b>Науково-інноваційна робота - НІ</b>','0',2,'',1,NULL,NULL),


(39,'5',1,'За здобуття в поточному році звань академіка або члена-кореспондента НАН України або державних галузевих академій наук:','0',2,'',2,51,NULL),
(40,'',0,'- академік НАН України','300',2,'',3,51,NULL),
(41,'',0,'- член-кореспондент НАН України','200',2,'',3,51,NULL),
(42,'',0,'- академік НААН, НАМН, НАПрН, НАМ України','200',2,'',3,51,NULL),
(43,'',0,'- член-кореспондент НААН, НАМН, НАПрН, НАМ України','150',2,'',3,51,NULL),

(44,'5',2,'За захист аспірантами, докторантами, здобувачами дисертацій:','0',2,'Бали нараховуються аспірантам, докторантам, здобувачам за наявності відповідного диплома',2,51,NULL),
(45,'',0,'- захист аспірантом кандидатської дисертації в термін навчання в аспірантурі','60',2,'',3,51,NULL),
(46,'',0,'- захист аспірантом або здобувачем кандидатської дисертації','40',2,'',3,51,NULL),
(47,'',0,'- захист докторської дисертації в термін навчання в докторантурі','100',2,'',3,51,NULL),
(48,'',0,'- захист докторської дисертації','90',2,'',3,51,NULL),

(49,'5',3,'За наукове керівництво чи консультування здобувачів наукових ступенів:','0',2,'Бали нараховуються науковим керівникам та консультантам за наявності відповідного диплома',2,51,NULL),
(50,'',0,'- захист аспірантом кандидатської дисертації в термін навчання в аспірантурі','30',2,'',3,51,NULL),
(51,'',0,'- захист аспірантом або здобувачем кандидатської дисертації','20',2,'',3,51,NULL),
(52,'',0,'- захист докторської дисертації в термін навчання в докторантурі','45',2,'',3,51,NULL),
(53,'',0,'- захист докторської дисертації','35',2,'',3,51,NULL),

(54,'5',4,'Керівництво НДР:','0',2,'У разі коли одна особа керує кількома НДР, то кількість балів додається',2,53,NULL),
(55,'',0,'- держбюджетною (за кожні 10 тис.грн. річного обсягу)','3',2,'',3,53,NULL),
(56,'',0,'- госпдоговірною (за кожні 10 тис.грн. річного обсягу)','2',2,'',3,53,NULL),
(57,'',0,'- грантовою (за кожні 10 тис.грн. річного обсягу)','2.5',2,'',3,53,NULL),
(58,'',0,'- виконання робіт за міжнародними контрактами (керівнику) (за кожні 10 тис.грн. річного обсягу)','2.5',2,'',3,53,NULL),

(59,'4',5,'Підсумкові результати виконання НДР:','0',2,'На всіх виконавців',2,53,NULL),
(60,'',0,'- впровадження результатів розробок у виробництво (технології, нормативні документи, дослідний зразок тощо)','30',2,'',3,53,NULL),
(61,'',0,'- впровадження у навчальний процес на основі НДР нової лабораторної роботи','10',2,'',3,53,NULL),
(62,'',0,'- створення та обладнання інноваційної лабораторії, бізнес-інкубатора, технопарку','40',2,'',3,53,NULL),

(63,'',6,'Одержання та поставлення на баланс обладнання для проведення НДР за спонсорські кошти (за кожні 10 тис.грн. річного обсягу)','2',2,'',4,53,NULL),

(64,'4',7,'Публікації статей у журналах, збірниках, вісниках:','0',2,'На авторський колектив',2,54,NULL),
(65,'',0,'- публікації в міжнародних журналах з імпакт-фактором та українських журналах, вісниках, що внесені у міжнародні наукометричні бази Scopus та WoS','50',2,'',3,54,NULL),
(66,'',0,'- публікації в міжнародних та українських журналах, вісниках, що внесені в інші міжнародні наукометричні бази','30',2,'',3,54,NULL),
(67,'',0,'- публікації в українських журналах, вісниках, що входять до переліку фахових видань, затверджених МОН України','20',2,'',3,32,NULL),

(68,'5',8,'Одержання охоронних документів:','0',2,'На авторський колектив',2,53,NULL),
(69,'',0,'- патентів на корисну модель','10',2,'',3,53,NULL),
(70,'',0,'- патентів України','20',2,'',3,53,NULL),
(71,'',0,'- міжнародних патентів','50',2,'',3,53,NULL),
(72,'',0,'- продаж патентів','100',2,'',3,53,NULL),

(73,'3',9,'Участь у конференціях, симпозіумах, з’їздах з публікацією матеріалів:','0',2,'На авторський колектив',2,32,NULL),
(74,'',0,'- у міжнародних (в Україні / за кордоном)','15 / 20',2,'',3,32,NULL),
(75,'',0,'- у всеукраїнських','10',2,'',3,32,NULL),

(76,'3',10,'Організація та проведення конференцій:','0',2,'На авторський колектив',2,32,NULL),
(77,'',0,'- міжнародних на базі університету','30',2,'',3,32,NULL),
(78,'',0,'- всеукраїнських','25',2,'',3,32,NULL),

(79,'4',11,'Виставкова діяльність:','0',2,'На авторський колектив',2,32,NULL),
(80,'',0,'- участь у міжнародних виставках за кордоном','50',2,'',3,32,NULL),
(81,'',0,'- участь у міжнародних виставках в Україні','40',2,'',3,32,NULL),
(82,'',0,'- участь у всеукраїнських виставках','30',2,'',3,32,NULL), 

(83,'7',12,'Керівництво науковою роботою студентів:','0',2,'За кожну нагороду, статтю, доповідь',2,32,NULL),
(84,'',0,'- гранти, що отримали студенти на міжнародних конкурсах','40',2,'',3,32,NULL),
(85,'',0,'- одержання студентом призового І-ІІІ місця на всеукраїнському конкурсі студентських НДР','30, 20, 10',2,'',3,53,NULL),
(86,'',0,'- керівництво студентами, які стали призерами міжнародних олімпіад І-ІІІ місце','40, 30, 20',2,'',3,32,NULL),
(87,'',0,'- керівництво студентами, які стали призерами всеукраїнських олімпіад І-ІІІ місце','30, 20, 10',2,'',3,32,NULL),
(88,'',0,'- публікація студентом (разом із викладачем) наукової статті у фаховому виданні','20',2,'',3,32,NULL),
(89,'',0,'- підготовка студентом (разом із викладачем) тез доповіді на конференцію','5',2,'',3,32,NULL),

(90,'',13,'Керівництво в поточному році Європейськими програмами (Tempus, Erasmus+, Seventh Framework Programme, Horizon 2020), за якими університет виграв гранти (за одну програму чи проект)','100',2,'',4,53,NULL),

(91,'',14,'Одержання звання лауреата Державної премії в галузі науки і техніки (премії ім. Т.Г.Шевченка) в поточному році','200',2,'',4,53,NULL),

(92,'',15,'Одержання премії Президента України для молодих вчених, 
				премії Верховної Ради України найталановитішим молодим ученим у поточному році','150',2,'',4,53,NULL),

(93,'',16,'Приріст індексу Гірша, розрахованого за базою даних Scopus, у порівнянні з попереднім роком (за кожний пункт приросту)','100',2,'',4,54,NULL),

(94,'',0,'<b>Організаційно-виховна робота - ОВ</b>','0',2,'',1,32,NULL),


(95,'',1,'Організація художньої самодіяльності в інституті','10',2,'',4,32,36),

(96,'',2,'Організація і проведення в університеті предметної студентської олімпіади, конкурсу студентських наукових робіт','15',2,'',4,52,36),

(97,'',3,'Організація і проведення Всеукраїнської предметної студентської олімпіади, конкурсу студентських наукових робіт','50',2,'',4,52,36),

(98,'5',4,'Організація і проведення спортивних змагань з різних видів спорту:','0',2,'',2,32,NULL),
(99,'',0,'- університетських','10',2,'',3,32,NULL),
(100,'',0,'- міських, обласних','15',2,'',3,32,NULL),
(101,'',0,'- всеукраїнських','30',2,'',3,32,NULL),
(102,'',0,'- міжнародних','40',2,'',3,32,NULL),

(103,'3',5,'Порушення трудової дисципліни (бали знімаються):','0',2,'',2,32,NULL),
(104,'',0,'- несвоєчасне виконання розпоряджень','-50',2,'',3,32,NULL),
(105,'',0,'- оголошення догани наказом ректора','-100',2,'',3,32,NULL),


(106,'',0,'<b>Організаційно-виховна робота директора - ОВ</b>','0',4,'',1,NULL,NULL),


(107,'6',1,'Організація і проведення культурно-масової роботи в інституті:','',4,'',2,35,1),
(108,'',0,'- організація і участь інституту в університетському конкурсі художньої самодіяльності I-III місце','20 (1-е м.)<br>15 (2-е м.)<br>10 (3-е м.)<br>5 (участь)',4,'',3,35,1),
(109,'',0,'- участь в університетському конкурсі команд КВК I-III місце','20 (1-е м.)<br>15 (2-е м.)<br>10 (3-е м.)<br>5 (участь)',4,'',3,35,1),
(110,'',0,'- організація і проведення урочистого святкування знаменних дат (за одне)','10',4,'' ,3,35,1),
(111,'',0,'- організація і проведення туристичних походів та інших культурно-масових інститутських заходів (за один)','5',4,'',3,35,1),
(112,'',0,'- виховна робота в гуртожитку згідно плану, ефективність проведення якої забезпечила виконання Положення про гуртожиток ІФНТУНГ','20',4,'' ,3,35,1),

(113,'3',2,'Ефективність роботи студентського самоврядування в інституті:','0',4,'',2,35,1),
(114,'',0,'- наявність плану та його виконання','2',4,'',3,35,1),
(115,'',0,'- гласність роботи - стінна газета, фотомонтажі (за кожний випуск)','2',4,'',3,35,1),

(116,'5',3,'Організація і проведення спортивно-масової роботи в інституті:','0',4,'',2,35,1), 
(117,'',0,'- спортивні змагання "Першокурсник"','3',4,'',3,35,1),
(118,'',0,'- факультетська (інститутська) спартакіада "Бадьорість і здоров\'я"','5',4,'',3,35,1),
(119,'',0,'- участь команди інституту в "Спартакіаді ІФНТУНГ" I-III місце','15 (1-е м.)<br>12 (2-е м.)<br>10 (3-е м.)<br>5 (участь)',4,'',3,35,1),
(120,'',0,'- участь команди інституту в інших спортивних змаганнях (за одне)','5',4,'',3,35,1),

(121,'',4,'Участь студентів інституту в культурно-масових та спортивно-масових заходах за межами університету (за кожного учасника)','1',4,'',4,35,1),

(122,'',5,'Зовнішнє якісне та змістовне оформлення кафедр інституту','2-10',4,'',4,35,1);

ALTER TABLE `question` ENABLE KEYS;

DROP TABLE IF EXISTS `teachResultCopy`;
CREATE TABLE `teachResultCopy` LIKE `teachResult`;
INSERT INTO `teachResultCopy` SELECT * FROM `teachResult`;

UPDATE `teachResult` SET `teachResult`.`tester_id` = 
(	SELECT `question`.`vidkontr_id` FROM `question`
	WHERE `teachResult`.`questionId` = `question`.`id` ) ;

UPDATE `teachResult` SET `tester_id` = 0 WHERE `tester_id` IS NULL;

UNLOCK TABLES;

/*
UPDATE `teachResult`, `question`
SET `teachResult`.`tester_id` = `question`.`vidkontr_id` 
WHERE `teachResult`.`questionId` = `question`.`id` 


UPDATE `teachResult`
LEFT JOIN `question` ON `teachResult`.`questionId` = `question`.`id` 
SET `teachResult`.`tester_id` = `question`.`vidkontr_id` 

UPDATE `teachResult`
LEFT JOIN `question` ON `teachResult`.`questionId` = `question`.`id` 
SET `teachResult`.`tester_id` = `question`.`vidkontr_id` 
*/